whiteEelsYikes/YH-PY32F030/DCHEM_PID/User/oled/OLED.c

/***************************************************************************************
  * �������ɽ�Э�Ƽ���������ѿ�Դ����
  * ���������鿴��ʹ�ú��޸ģ���Ӧ�õ��Լ�����Ŀ֮��
  * �����Ȩ�齭Э�Ƽ����У��κ��˻���֯���ý����Ϊ����
  * 
  * �������ƣ�				0.96��OLED��ʾ����������4���I2C�ӿڣ�
  * ���򴴽�ʱ�䣺			2023.10.24
  * ��ǰ����汾��			V2.0
  * ��ǰ�汾����ʱ�䣺		2024.10.20
  * 
  * ��Э�Ƽ��ٷ���վ��		jiangxiekeji.com
  * ��Э�Ƽ��ٷ��Ա��꣺	jiangxiekeji.taobao.com
  * ������ܼ����¶�̬��	jiangxiekeji.com/tutorial/oled.html
  * 
  * ����㷢�ֳ����е�©�����߱��󣬿�ͨ���ʼ������Ƿ�����feedback@jiangxiekeji.com
  * �����ʼ�֮ǰ��������ȵ����¶�̬ҳ��鿴���³�������������Ѿ��޸ģ��������ٷ��ʼ�
  ***************************************************************************************
  */

#include "py32f0xx_hal.h"
#include "OLED.h"
#include <string.h>
#include <math.h>
#include <stdio.h>
#include <stdarg.h>

/**
  * ���ݴ洢��ʽ��
  * ����8�㣬��λ���£��ȴ����ң��ٴ��ϵ���
  * ÿһ��Bit��Ӧһ�����ص�
  * 
  *      B0 B0                  B0 B0
  *      B1 B1                  B1 B1
  *      B2 B2                  B2 B2
  *      B3 B3  ------------->  B3 B3 --
  *      B4 B4                  B4 B4  |
  *      B5 B5                  B5 B5  |
  *      B6 B6                  B6 B6  |
  *      B7 B7                  B7 B7  |
  *                                    |
  *  -----------------------------------
  *  |   
  *  |   B0 B0                  B0 B0
  *  |   B1 B1                  B1 B1
  *  |   B2 B2                  B2 B2
  *  --> B3 B3  ------------->  B3 B3
  *      B4 B4                  B4 B4
  *      B5 B5                  B5 B5
  *      B6 B6                  B6 B6
  *      B7 B7                  B7 B7
  * 
  * �����ᶨ�壺
  * ���Ͻ�Ϊ(0, 0)��
  * ��������ΪX�ᣬȡֵ��Χ��0~127
  * ��������ΪY�ᣬȡֵ��Χ��0~63
  * 
  *       0             X��           127 
  *      .------------------------------->
  *    0 |
  *      |
  *      |
  *      |
  *  Y�� |
  *      |
  *      |
  *      |
  *   63 |
  *      v
  * 
  */


/*ȫ�ֱ���*********************/

/**
  * OLED�Դ�����
  * ���е���ʾ��������ֻ�ǶԴ��Դ�������ж�д
  * ������OLED_Update������OLED_UpdateArea����
  * �ŻὫ�Դ���������ݷ��͵�OLEDӲ����������ʾ
  */
uint8_t OLED_DisplayBuf[8][128];
I2C_HandleTypeDef I2cHandle;
DMA_HandleTypeDef hdma_oled;


/*********************ȫ�ֱ���*/


/*��������*********************/

/**
  * ��    ����OLEDдSCL�ߵ͵�ƽ
  * ��    ����Ҫд��SCL�ĵ�ƽֵ����Χ��0/1
  * �� �� ֵ����
  * ˵    �������ϲ㺯����ҪдSCLʱ���˺����ᱻ����
  *           �û���Ҫ���ݲ��������ֵ����SCL��Ϊ�ߵ�ƽ���ߵ͵�ƽ
  *           ����������0ʱ����SCLΪ�͵�ƽ������������1ʱ����SCLΪ�ߵ�ƽ
  */
// void OLED_W_SCL(uint8_t BitValue)
// {
// 	/*����BitValue��ֵ����SCL�øߵ�ƽ���ߵ͵�ƽ*/
// 	GPIO_WriteBit(GPIOB, GPIO_Pin_8, (BitAction)BitValue);
	
// 	/*�����Ƭ���ٶȹ��죬���ڴ�����������ʱ���Ա��ⳬ��I2Cͨ�ŵ�����ٶ�*/
// 	//...
// }

/**
  * ��    ����OLEDдSDA�ߵ͵�ƽ
  * ��    ����Ҫд��SDA�ĵ�ƽֵ����Χ��0/1
  * �� �� ֵ����
  * ˵    �������ϲ㺯����ҪдSDAʱ���˺����ᱻ����
  *           �û���Ҫ���ݲ��������ֵ����SDA��Ϊ�ߵ�ƽ���ߵ͵�ƽ
  *           ����������0ʱ����SDAΪ�͵�ƽ������������1ʱ����SDAΪ�ߵ�ƽ
  */
// void OLED_W_SDA(uint8_t BitValue)
// {
// 	/*����BitValue��ֵ����SDA�øߵ�ƽ���ߵ͵�ƽ*/
// 	GPIO_WriteBit(GPIOB, GPIO_Pin_9, (BitAction)BitValue);
	
// 	/*�����Ƭ���ٶȹ��죬���ڴ�����������ʱ���Ա��ⳬ��I2Cͨ�ŵ�����ٶ�*/
// 	//...
// }

/**
  * ��    ����OLED���ų�ʼ��
  * ��    ������
  * �� �� ֵ����
  * ˵    �������ϲ㺯����Ҫ��ʼ��ʱ���˺����ᱻ����
  *           �û���Ҫ��SCL��SDA���ų�ʼ��Ϊ��©ģʽ�����ͷ�����
  */
void OLED_GPIO_Init(void)
{
	I2cHandle.Instance             = I2C;                       /* I2C */
    I2cHandle.Mode                 = HAL_I2C_MODE_MASTER;       /* ����ģʽ */
    I2cHandle.Init.ClockSpeed      = I2C_SPEEDCLOCK;            /* I2CͨѶ�ٶ� */
    I2cHandle.Init.DutyCycle       = I2C_DUTYCYCLE;             /* I2Cռ�ձ� */
    I2cHandle.Init.OwnAddress1     = I2C_ADDRESS;               /* I2C��ַ */
    I2cHandle.Init.GeneralCallMode = I2C_GENERALCALL_DISABLE;   /* ��ֹ�㲥���� */
    I2cHandle.Init.NoStretchMode   = I2C_NOSTRETCH_DISABLE;     /* ����ʱ���ӳ� */
    
    HAL_I2C_Init(&I2cHandle);
}


/*********************��������*/


/*ͨ��Э��*********************/

/**
  * ��    ����I2C��ʼ
  * ��    ������
  * �� �� ֵ����
  */
// void OLED_I2C_Start(void)
// {
// 	OLED_W_SDA(1);		//�ͷ�SDA��ȷ��SDAΪ�ߵ�ƽ
// 	OLED_W_SCL(1);		//�ͷ�SCL��ȷ��SCLΪ�ߵ�ƽ
// 	OLED_W_SDA(0);		//��SCL�ߵ�ƽ�ڼ䣬����SDA��������ʼ�ź�
// 	OLED_W_SCL(0);		//��ʼ���SCLҲ���ͣ���Ϊ��ռ�����ߣ�ҲΪ�˷�������ʱ���ƴ��
// }

/**
  * ��    ����I2C��ֹ
  * ��    ������
  * �� �� ֵ����
  */
// void OLED_I2C_Stop(void)
// {
// 	OLED_W_SDA(0);		//����SDA��ȷ��SDAΪ�͵�ƽ
// 	OLED_W_SCL(1);		//�ͷ�SCL��ʹSCL���ָߵ�ƽ
// 	OLED_W_SDA(1);		//��SCL�ߵ�ƽ�ڼ䣬�ͷ�SDA��������ֹ�ź�
// }

/**
  * ��    ����I2C����һ���ֽ�
  * ��    ����Byte Ҫ���͵�һ���ֽ����ݣ���Χ��0x00~0xFF
  * �� �� ֵ����
  */
// void OLED_I2C_SendByte(uint8_t Byte)
// {
// 	uint8_t i;
//	
// 	/*ѭ��8�Σ��������η������ݵ�ÿһλ*/
// 	for (i = 0; i < 8; i++)
// 	{
// 		/*ʹ������ķ�ʽȡ��Byte��ָ��һλ���ݲ�д�뵽SDA��*/
// 		/*����!�������ǣ������з����ֵ��Ϊ1*/
// 		OLED_W_SDA(!!(Byte & (0x80 >> i)));
// 		OLED_W_SCL(1);	//�ͷ�SCL���ӻ���SCL�ߵ�ƽ�ڼ��ȡSDA
// 		OLED_W_SCL(0);	//����SCL��������ʼ������һλ����
// 	}
//	
// 	OLED_W_SCL(1);		//�����һ��ʱ�ӣ�������Ӧ���ź�
// 	OLED_W_SCL(0);
// }


extern DMA_HandleTypeDef hdma_mpu6050;
extern I2C_HandleTypeDef mpu6050;

void DMA1_Channel2_3_IRQHandler(void)
{
  HAL_DMA_IRQHandler(I2cHandle.hdmatx);
	// ��鲢����DMAͨ��2���ж�
	if(__HAL_DMA_GET_FLAG(&I2cHandle, DMA_FLAG_TC2))
	{
//			// ���DMAͨ��2�Ĵ�����ɱ�־
//			__HAL_DMA_CLEAR_FLAG(&I2cHandle, DMA_FLAG_TC2);
			// ����DMA RX���жϴ�������
			HAL_DMA_IRQHandler(I2cHandle.hdmatx);
	}

	// ��鲢����DMAͨ��3���ж�
	if(__HAL_DMA_GET_FLAG(&mpu6050, DMA_FLAG_TC3))
	{
			// ���DMAͨ��3�Ĵ�����ɱ�־
//			__HAL_DMA_CLEAR_FLAG(&mpu6050, DMA_FLAG_TC3);
			// ����DMA TX���жϴ�������
			HAL_DMA_IRQHandler(mpu6050.hdmarx);
	}
}

/**
  * @brief This function handles I2C1 Interrupt .
  */
void I2C1_IRQHandler(void)
{
//  HAL_I2C_EV_IRQHandler(&I2cHandle);
	// ���I2C1�¼��ж�״̬��������Ӧ�Ĵ�������
	if (__HAL_I2C_GET_FLAG(&I2cHandle, I2C_FLAG_ADDR) || __HAL_I2C_GET_FLAG(&I2cHandle, I2C_FLAG_RXNE) || __HAL_I2C_GET_FLAG(&I2cHandle, I2C_FLAG_TXE) || __HAL_I2C_GET_FLAG(&I2cHandle, I2C_FLAG_BTF) || __HAL_I2C_GET_FLAG(&I2cHandle, I2C_FLAG_STOPF))
	{
			HAL_I2C_EV_IRQHandler(&I2cHandle);
	}

	// ���I2C2�¼��ж�״̬��������Ӧ�Ĵ�������
	if (__HAL_I2C_GET_FLAG(&mpu6050, I2C_FLAG_ADDR) || __HAL_I2C_GET_FLAG(&mpu6050, I2C_FLAG_RXNE) || __HAL_I2C_GET_FLAG(&mpu6050, I2C_FLAG_TXE) || __HAL_I2C_GET_FLAG(&mpu6050, I2C_FLAG_BTF) || __HAL_I2C_GET_FLAG(&mpu6050, I2C_FLAG_STOPF))
	{
			HAL_I2C_EV_IRQHandler(&mpu6050);
	}
}



void I2C_WriteByte_DMA(uint8_t addr, uint8_t data)
{
    HAL_I2C_Master_Transmit_DMA(&I2cHandle, addr, &data, sizeof(data));

